In [13]:
import pandas as pd

# read excel

In [14]:
df = pd.read_excel('test.xlsx', sheet_name = '매출액')

df.head()

         corp_nm   2016   2017
68400      AJ렌터카   6476   6368
139130   DGB금융지주  36550  36418
17940         E1  39959  44082
114090       GKL      0      0
83420   KPX그린케미칼      0      0

# insert an new column at a specific column index

In [15]:
df.insert(2, '2017/03', 1234)

df.head()

         corp_nm   2016  2017/03   2017
68400      AJ렌터카   6476     1234   6368
139130   DGB금융지주  36550     1234  36418
17940         E1  39959     1234  44082
114090       GKL      0     1234      0
83420   KPX그린케미칼      0     1234      0

# write data to excel

In [17]:
writer = pd.ExcelWriter('test.xlsx')
df.to_excel(writer, sheet_name='매출액', index=True)
writer.save()